``` sql
create table input(location varchar(50));

insert into input values('Delhi');
insert into input values('Mumbai');
insert into input values('Chennai');

select * from input;

+----------+
| location |
+----------+
| Delhi    |
| Mumbai   |
| Chennai  |
+----------+

question: Write an SQL query to display the ascii values for each and every character of location mentioned in the below table.

expected output:

+----------+---------------------+
| location | ascii_num_name      |
+----------+---------------------+
| Chennai  | 6710410111011097105 |
| Delhi    | 68101108104105      |
| Mumbai   | 771171099897105     |
+----------+---------------------+

```
### **Solution**
``` sql
WITH RECURSIVE char_split AS (
  SELECT 
    1 AS pos,
    SUBSTRING(location, 1, 1) AS ch,
    location,
    LENGTH(location) AS len
    from input
  UNION ALL
  SELECT 
    pos + 1 as pos,
    SUBSTRING(location, pos + 1, 1) as ch,
    location,
    len
  FROM char_split
  WHERE pos < len
)

select location, group_concat(ascii(ch) order by pos SEPARATOR '') as ascii_num_name
from char_split group by location;